Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.ModifyConicalRadiuses Method
 Modify the radiuses of a conical section, preserving the length of the side boundaries. The order of the provided radiuses is not relevant, as the cone vertex will be located on the same side of the plates as the original cone section.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry ModifyConicalRadiuses(
	ConnectiveGeometry geometry,
	GeometrySection conicalSection,
	double radius1,
	double radius2
)
Public Function ModifyConicalRadiuses (
	geometry As ConnectiveGeometry,
	conicalSection As GeometrySection,
	radius1 As Double,
	radius2 As Double
) As ConnectiveGeometry
Parameters
geometry
Type: Tekla.Structures.Model.ConnectiveGeometry
Reference geometry to modify which contains conicalSection.
conicalSection
Type: Tekla.Structures.Model.GeometrySection
The conical geometry section to modify.
radius1
Type: System.Double
New radius one of the cross sections of the cone.
radius2
Type: System.Double
New radius of the other cross section of the cone.
Return Value
Type: ConnectiveGeometry
Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Exceptions
Exception | Condition
ConnectiveGeometryException | Thrown if could not modify the geometry.
See Also
Reference
BentPlateGeometrySolver Class
Tekla.Structures.Model Namespace